CREATE TABLE [dbo].[Нормы расхода ГСМ на авто,тракторы]
(
	[ID] [int] IDENTITY(1,1) NOT NULL  CONSTRAINT [Нормы_ID]  PRIMARY KEY ([ID]),
	[Марка автомобиля] [nvarchar](30) NOT NULL,
	[Вид топлива] [nvarchar](10) NULL,
	[Норма расхода на 100 км летняя 6%] [float] NULL,
	[Марка двигателя] [nvarchar](30) NULL,
	[Норма на машино час летняя] [float] NULL,
	[Н-ма расх.масел на 100л р-да топлива моторное,л] [float] NULL,
	[Н-ма расх.масел на 100л р-да трансмиссионное,л] [float] NULL,
	[Н-ма расх.масел на 100л р-да топлива специальное,л] [float] NULL,
	[Н-ма расх.масел на 100л р-да топлива пластичные смазки,л] [float] NULL,
)
