/*
Post-Deployment Script Template							
--------------------------------------------------------------------------------------
 This file contains SQL statements that will be appended to the build script.		
 Use SQLCMD syntax to include a file in the post-deployment script.			
 Example:      :r .\myfile.sql								
 Use SQLCMD syntax to reference a variable in the post-deployment script.		
 Example:      :setvar TableName MyTable							
               SELECT * FROM [$(TableName)]					
--------------------------------------------------------------------------------------
*/


IF NOT EXISTS (SELECT ID FROM [Нормы расхода ГСМ на авто,тракторы])
BEGIN
SET IDENTITY_INSERT [Путевые листы].[dbo].[Нормы расхода ГСМ на авто,тракторы] on
INSERT INTO [Путевые листы].[dbo].[Нормы расхода ГСМ на авто,тракторы]
           ([ID] ,[Марка автомобиля],[Вид топлива],[Норма расхода на 100 км летняя 6%] ,
           [Марка двигателя],[Норма на машино час летняя] ,
           [Н-ма расх.масел на 100л р-да топлива моторное,л],[Н-ма расх.масел на 100л р-да трансмиссионное,л] ,[Н-ма расх.масел на 100л р-да топлива специальное,л],[Н-ма расх.масел на 100л р-да топлива пластичные смазки,л])
     VALUES
           (1,'ГАЗ 3110','бен.',9.9,'ЗМЗ 4062', NULL, 1.7,0.15,0.05,0.1),
           (2,'УАЗ 3303','бен.',15.2,'ЗМЗ 4218 4 WD', NULL,2.2,0.2,0.05,0.2),
           (3,'ГАЗ 33021','бен.',14.5,'ЗМЗ 4026,10',NULL ,1.7,0.15,0.05,0.2),
           (4,'ГАЗ 33021','СУГ',19.0,'ЗМЗ 4026,10',NULL,1.7,0.15,0.05,0.2),
           (5,'ГАЗ 3302','бен',14.7 ,'ЗМЗ 4063А',NULL ,1.7,0.15,0.05,0.2),
           (6,'ГАЗ 3302','СУГ', 19.0,'ЗМЗ 4063А',NULL ,1.7,0.15,0.05,0.2),
           (7,'ГАЗ 3307','бен.',23.8,'ЗМЗ 5130ОМ',NULL,2.1,0.3,0.1,0.25),
           (8,'ЗИЛ ММЗ 4502','бен.',36.3,'ЗИЛ 375',NULL ,2.0,0.3,0.1,0.2),
           (9,'ЗИЛ 4331','бен.',33.3,'ЗИЛ 375',NULL ,2.0,0.3,0.1,0.2),
           (10,'ЗИЛ КС2571А-1(автокран)','бен.',38.0,'ЗИЛ 130',6.1,2.2,0.3,0.1,0.2),
           (11,'МАЗ 5340 А5-370','д/т',28.8,'ЯМЗ 6582.10',NULL ,2.0,0.3,0.15,0.25),
           (12,'ГАЗ 33104','д/т',14.7,'Д 245-7Е2',NULL ,1.7,0.15,0.05,0.1),
           (13,'ГАЗ 331041-317','д/т',15.7,'Д 245-7Е3',NULL ,1.7,0.15,0.05,0.1),
           (14,'Саманд LX','бен.',9.5,'1.8 I',NULL,0.4,NULL , NULL,NULL),
           (15,'Беларусь 82.1','д/т',NULL,'Д 243',7.0,4.0,0.5,1.0,0.3),
           (16,'МТЗ 80*','д/т',NULL,'Д 243',6.5,5.0,0.5,1.0,0.3),
           (17,'Шкода Октавия**','бен',9.5 ,'1,8/118кВт TFSI-EU4',NULL ,0.4,NULL ,NULL ,NULL ),
           (18,'Шкода Практик','д/т',5.6 ,'1,4/59кВт TDIPD-EU4',NULL ,0.2,NULL , NULL,NULL ),
           (19,'Фиат Добло','д/т',6.6 ,'1,3Multijet DPF',NULL,0.1,0.01,NULL,0.1),
           (20,'РАК 8А','д/т',NULL,'S312C',1.8,5.0,0.5,1.0,0.3);
SET IDENTITY_INSERT [Путевые листы].[dbo].[Нормы расхода ГСМ на авто,тракторы] OFF
END
           
           
           
GO

IF NOT EXISTS (SELECT ID FROM [Путевые листы].[dbo].[Нормы расхода ГСМ на авто,тракторы])
BEGIN
SET IDENTITY_INSERT [Путевые листы].[dbo].[Нормы расхода ГСМ на авто,тракторы] on
INSERT INTO [Путевые листы].[dbo].[Нормы расхода ГСМ2 на авто,тракторы]
           (ID ,[Марка автомобиля],[Вид топлива],[Норма расхода на 100 км летняя 6%] ,[Марка двигателя],[Норма на машино час летняя] ,[Н-ма расх.масел на 100л р-да топлива моторное,л],[Н-ма расх.масел на 100л р-да трансмиссионное,л] ,[Н-ма расх.масел на 100л р-да топлива специальное,л],[Н-ма расх.масел на 100л р-да топлива пластичные смазки,л])
     VALUES
           (1,'КаМАЗ 53212','д/т',26.8,'КаМАЗ 740.10',NULL,2.8,0.4,0.15,0.35),
           (2,'ЗИЛ 433100','д/т',23.2,'ЗИЛ 645',NULL,2.8,0.4,0.15,0.35),
           (3,'Д-606','д/т',NULL,'А-41',7.6,5.0,0.5,1.0,0.3),
           (4,'Нисан 18 NRW9','д/т',NULL,'ISUZU C-240',1.8 ,2.0,0.3,0.6,0.2),
           (5,'АМЖК-8(мини-трактор)','бен.',NULL,'УД-2',0.5 ,0.5,0.1,0.2,0.1),
           (6,'ГАЗ 330202','д/т',10.3,'ISF2.8S3129T',NULL,1.0,0.15,0.05,0.1),
           (7,'Джили SC7','бен.','8,2',NULL,NULL,NULL,NULL,NULL,NULL);
                      
  SET IDENTITY_INSERT [Путевые листы].[dbo].[Нормы расхода ГСМ на авто,тракторы] OFF
END         
           
           